./.build/x86_64-unknown-linux/debug/ModuleCache/33J8DIMD7H8ZB/Clibavahiclient-2J8WBHG3Q43SC.pcm:	file format ELF64-x86-64

.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp
	DW_AT_language	DW_FORM_data2
	DW_AT_name	DW_FORM_strp
	DW_AT_stmt_list	DW_FORM_sec_offset
	DW_AT_comp_dir	DW_FORM_strp
	DW_AT_GNU_pubnames	DW_FORM_flag_present
	DW_AT_GNU_dwo_id	DW_FORM_data8

[2] DW_TAG_module	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_strp
	DW_AT_LLVM_config_macros	DW_FORM_strp
	DW_AT_LLVM_include_path	DW_FORM_strp
	DW_AT_LLVM_isysroot	DW_FORM_strp

[3] DW_TAG_enumeration_type	DW_CHILDREN_yes
	DW_AT_byte_size	DW_FORM_data1
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data1

[4] DW_TAG_enumerator	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_const_value	DW_FORM_sdata

[5] DW_TAG_enumeration_type	DW_CHILDREN_yes
	DW_AT_byte_size	DW_FORM_data1
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data2

[6] DW_TAG_typedef	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4
	DW_AT_name	DW_FORM_strp
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data1

[7] DW_TAG_structure_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_strp
	DW_AT_byte_size	DW_FORM_data1
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data1

[8] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strp
	DW_AT_type	DW_FORM_ref4
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data1
	DW_AT_data_member_location	DW_FORM_data1


                    DW_AT_name	("AVAHI_ERR_OS")
                    DW_AT_const_value	(-19)

0x000002a2:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_ACCESS_DENIED")
                    DW_AT_const_value	(-20)

0x000002a8:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_OPERATION")
                    DW_AT_const_value	(-21)

0x000002ae:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_DBUS_ERROR")
                    DW_AT_const_value	(-22)

0x000002b4:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_DISCONNECTED")
                    DW_AT_const_value	(-23)

0x000002ba:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_NO_MEMORY")
                    DW_AT_const_value	(-24)

0x000002c0:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_OBJECT")
                    DW_AT_const_value	(-25)

0x000002c6:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_NO_DAEMON")
                    DW_AT_const_value	(-26)

0x000002cc:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_INTERFACE")
                    DW_AT_const_value	(-27)

0x000002d2:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_PROTOCOL")
                    DW_AT_const_value	(-28)

0x000002d8:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_FLAGS")
                    DW_AT_const_value	(-29)

0x000002de:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_NOT_FOUND")
                    DW_AT_const_value	(-30)

0x000002e4:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_CONFIG")
                    DW_AT_const_value	(-31)

0x000002ea:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_VERSION_MISMATCH")
                    DW_AT_const_value	(-32)

0x000002f0:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_SERVICE_SUBTYPE")
                    DW_AT_const_value	(-33)

0x000002f6:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_PACKET")
                    DW_AT_const_value	(-34)

0x000002fc:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_DNS_ERROR")
                    DW_AT_const_value	(-35)

0x00000302:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_DNS_FORMERR")
                    DW_AT_const_value	(-36)

0x00000308:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_DNS_SERVFAIL")
                    DW_AT_const_value	(-37)

0x0000030e:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_DNS_NXDOMAIN")
                    DW_AT_const_value	(-38)

0x00000314:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_DNS_NOTIMP")
                    DW_AT_const_value	(-39)

0x0000031a:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_DNS_REFUSED")
                    DW_AT_const_value	(-40)

0x00000320:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_DNS_YXDOMAIN")
                    DW_AT_const_value	(-41)

0x00000326:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_DNS_YXRRSET")
                    DW_AT_const_value	(-42)

0x0000032c:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_DNS_NXRRSET")
                    DW_AT_const_value	(-43)

0x00000332:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_DNS_NOTAUTH")
                    DW_AT_const_value	(-44)

0x00000338:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_DNS_NOTZONE")
                    DW_AT_const_value	(-45)

0x0000033e:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_RDATA")
                    DW_AT_const_value	(-46)

0x00000344:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_DNS_CLASS")
                    DW_AT_const_value	(-47)

0x0000034a:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_DNS_TYPE")
                    DW_AT_const_value	(-48)

0x00000350:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_NOT_SUPPORTED")
                    DW_AT_const_value	(-49)

0x00000356:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_NOT_PERMITTED")
                    DW_AT_const_value	(-50)

0x0000035c:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_INVALID_ARGUMENT")
                    DW_AT_const_value	(-51)

0x00000362:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_IS_EMPTY")
                    DW_AT_const_value	(-52)

0x00000368:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_NO_CHANGE")
                    DW_AT_const_value	(-53)

0x0000036e:       DW_TAG_enumerator
                    DW_AT_name	("AVAHI_ERR_MAX")
                    DW_AT_const_value	(-54)

0x00000374:       NULL

0x00000375:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x069a "int")
                  DW_AT_name	("AvahiProtocol")
                  DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                  DW_AT_decl_line	(33)

0x00000380:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x069a "int")
                  DW_AT_name	("AvahiIfIndex")
                  DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                  DW_AT_decl_line	(36)

0x0000038b:     DW_TAG_structure_type
                  DW_AT_name	("AvahiIPv4Address")
                  DW_AT_byte_size	(0x04)
                  DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                  DW_AT_decl_line	(60)

0x00000393:       DW_TAG_member
                    DW_AT_name	("address")
                    DW_AT_type	(cu + 0x06d4 "uint32_t")
                    DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                    DW_AT_decl_line	(61)
                    DW_AT_data_member_location	(0x00)

0x0000039f:       NULL

0x000003a0:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x038b "AvahiIPv4Address")
                  DW_AT_name	("AvahiIPv4Address")
                  DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                  DW_AT_decl_line	(62)

0x000003ab:     DW_TAG_structure_type
                  DW_AT_name	("AvahiIPv6Address")
                  DW_AT_byte_size	(0x10)
                  DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                  DW_AT_decl_line	(65)

0x000003b3:       DW_TAG_member
                    DW_AT_name	("address")
                    DW_AT_type	(cu + 0x07a1 "uint8_t[]")
                    DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                    DW_AT_decl_line	(66)
                    DW_AT_data_member_location	(0x00)

0x000003bf:       NULL

0x000003c0:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x03ab "AvahiIPv6Address")
                  DW_AT_name	("AvahiIPv6Address")
                  DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                  DW_AT_decl_line	(67)

0x000003cb:     DW_TAG_structure_type
                  DW_AT_name	("AvahiAddress")
                  DW_AT_byte_size	(0x14)
                  DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                  DW_AT_decl_line	(70)

0x000003d3:       DW_TAG_member
                    DW_AT_name	("proto")
                    DW_AT_type	(cu + 0x0375 "AvahiProtocol")
                    DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                    DW_AT_decl_line	(71)
                    DW_AT_data_member_location	(0x00)

0x000003df:       DW_TAG_member
                    DW_AT_name	("data")
                    DW_AT_type	(cu + 0x03eb "union ")
                    DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                    DW_AT_decl_line	(77)
                    DW_AT_data_member_location	(0x04)

0x000003eb:       DW_TAG_union_type
                    DW_AT_byte_size	(0x10)
                    DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                    DW_AT_decl_line	(73)

0x000003ef:         DW_TAG_member
                      DW_AT_name	("ipv6")
                      DW_AT_type	(cu + 0x03c0 "AvahiIPv6Address")
                      DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                      DW_AT_decl_line	(74)
                      DW_AT_data_member_location	(0x00)

0x000003fb:         DW_TAG_member
                      DW_AT_name	("ipv4")
                      DW_AT_type	(cu + 0x03a0 "AvahiIPv4Address")
                      DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                      DW_AT_decl_line	(75)
                      DW_AT_data_member_location	(0x00)

0x00000407:         DW_TAG_member
                      DW_AT_name	("data")
                      DW_AT_type	(cu + 0x07bb "uint8_t[]")
                      DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                      DW_AT_decl_line	(76)
                      DW_AT_data_member_location	(0x00)

0x00000413:         NULL

0x00000414:       NULL

0x00000415:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x03cb "AvahiAddress")
                  DW_AT_name	("AvahiAddress")
                  DW_AT_decl_file	("//usr/include/avahi-common/address.h")
                  DW_AT_decl_line	(78)

0x00000420:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x07d4 "__builtin_va_list")
                  DW_AT_name	("va_list")
                  DW_AT_decl_file	("/opt/swift-4.2.1-RELEASE-ubuntu18.04/usr/lib/swift/clang/include/stdarg.h")
                  DW_AT_decl_line	(30)

0x0000042b:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x07d4 "__builtin_va_list")
                  DW_AT_name	("__gnuc_va_list")
                  DW_AT_decl_file	("/opt/swift-4.2.1-RELEASE-ubuntu18.04/usr/lib/swift/clang/include/stdarg.h")
                  DW_AT_decl_line	(48)

0x00000436:     DW_TAG_structure_type
                  DW_AT_name	("AvahiStringList")
                  DW_AT_byte_size	(0x18)
                  DW_AT_decl_file	("//usr/include/avahi-common/strlst.h")
                  DW_AT_decl_line	(40)

0x0000043e:       DW_TAG_member
                    DW_AT_name	("next")
                    DW_AT_type	(cu + 0x081a "AvahiStringList*")
                    DW_AT_decl_file	("//usr/include/avahi-common/strlst.h")
                    DW_AT_decl_line	(41)
                    DW_AT_data_member_location	(0x00)

0x0000044a:       DW_TAG_member
                    DW_AT_name	("size")
                    DW_AT_type	(cu + 0x075d "size_t")
                    DW_AT_decl_file	("//usr/include/avahi-common/strlst.h")
                    DW_AT_decl_line	(42)
                    DW_AT_data_member_location	(0x08)

0x00000456:       DW_TAG_member
                    DW_AT_name	("text")
                    DW_AT_type	(cu + 0x07bb "uint8_t[]")
                    DW_AT_decl_file	("//usr/include/avahi-common/strlst.h")
                    DW_AT_decl_line	(43)
                    DW_AT_data_member_location	(0x10)

0x00000462:       NULL

0x00000463:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0436 "AvahiStringList")
                  DW_AT_name	("AvahiStringList")
                  DW_AT_decl_file	("//usr/include/avahi-common/strlst.h")
                  DW_AT_decl_line	(44)

0x0000046e:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0059 "enumeration ")
                  DW_AT_name	("AvahiServerState")
                  DW_AT_decl_file	("//usr/include/avahi-common/defs.h")
                  DW_AT_decl_line	(227)

0x00000479:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x007c "enumeration ")
                  DW_AT_name	("AvahiEntryGroupState")
                  DW_AT_decl_file	("//usr/include/avahi-common/defs.h")
                  DW_AT_decl_line	(236)

0x00000484:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x009f "enumeration ")
                  DW_AT_name	("AvahiPublishFlags")
                  DW_AT_decl_file	("//usr/include/avahi-common/defs.h")
                  DW_AT_decl_line	(257)

0x00000490:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x00dd "enumeration ")
                  DW_AT_name	("AvahiLookupFlags")
                  DW_AT_decl_file	("//usr/include/avahi-common/defs.h")
                  DW_AT_decl_line	(267)

0x0000049c:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x00fb "enumeration ")
                  DW_AT_name	("AvahiLookupResultFlags")
                  DW_AT_decl_file	("//usr/include/avahi-common/defs.h")
                  DW_AT_decl_line	(277)

0x000004a8:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0125 "enumeration ")
                  DW_AT_name	("AvahiBrowserEvent")
                  DW_AT_decl_file	("//usr/include/avahi-common/defs.h")
                  DW_AT_decl_line	(290)

0x000004b4:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0149 "enumeration ")
                  DW_AT_name	("AvahiResolverEvent")
                  DW_AT_decl_file	("//usr/include/avahi-common/defs.h")
                  DW_AT_decl_line	(296)

0x000004c0:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x015b "enumeration ")
                  DW_AT_name	("AvahiDomainBrowserType")
                  DW_AT_decl_file	("//usr/include/avahi-common/defs.h")
                  DW_AT_decl_line	(310)

0x000004cc:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0826 "AvahiWatch")
                  DW_AT_name	("AvahiWatch")
                  DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                  DW_AT_decl_line	(33)

0x000004d7:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x082b "AvahiTimeout")
                  DW_AT_name	("AvahiTimeout")
                  DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                  DW_AT_decl_line	(36)

0x000004e2:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x04ed "AvahiPoll")
                  DW_AT_name	("AvahiPoll")
                  DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                  DW_AT_decl_line	(39)

0x000004ed:     DW_TAG_structure_type
                  DW_AT_name	("AvahiPoll")
                  DW_AT_byte_size	(0x40)
                  DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                  DW_AT_decl_line	(60)

0x000004f5:       DW_TAG_member
                    DW_AT_name	("userdata")
                    DW_AT_type	(cu + 0x0819 "*")
                    DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                    DW_AT_decl_line	(63)
                    DW_AT_data_member_location	(0x00)

0x00000501:       DW_TAG_member
                    DW_AT_name	("watch_new")
                    DW_AT_type	(cu + 0x0830 "subroutine AvahiWatch**")
                    DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                    DW_AT_decl_line	(68)
                    DW_AT_data_member_location	(0x08)

0x0000050d:       DW_TAG_member
                    DW_AT_name	("watch_update")
                    DW_AT_type	(cu + 0x087e "subroutine *")
                    DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                    DW_AT_decl_line	(71)
                    DW_AT_data_member_location	(0x10)

0x00000519:       DW_TAG_member
                    DW_AT_name	("watch_get_events")
                    DW_AT_type	(cu + 0x088f "subroutine AvahiWatchEvent*")
                    DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                    DW_AT_decl_line	(74)
                    DW_AT_data_member_location	(0x18)

0x00000525:       DW_TAG_member
                    DW_AT_name	("watch_free")
                    DW_AT_type	(cu + 0x089f "subroutine *")
                    DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                    DW_AT_decl_line	(77)
                    DW_AT_data_member_location	(0x20)

0x00000531:       DW_TAG_member
                    DW_AT_name	("timeout_new")
                    DW_AT_type	(cu + 0x08ab "subroutine AvahiTimeout**")
                    DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                    DW_AT_decl_line	(84)
                    DW_AT_data_member_location	(0x28)

0x0000053d:       DW_TAG_member
                    DW_AT_name	("timeout_update")
                    DW_AT_type	(cu + 0x08ea "subroutine *")
                    DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                    DW_AT_decl_line	(88)
                    DW_AT_data_member_location	(0x30)

0x00000549:       DW_TAG_member
                    DW_AT_name	("timeout_free")
                    DW_AT_type	(cu + 0x08fb "subroutine *")
                    DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                    DW_AT_decl_line	(91)
                    DW_AT_data_member_location	(0x38)

0x00000555:       NULL

0x00000556:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x01d3 "enumeration ")
                  DW_AT_name	("AvahiWatchEvent")
                  DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                  DW_AT_decl_line	(47)

0x00000561:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0863 "subroutine *")
                  DW_AT_name	("AvahiWatchCallback")
                  DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                  DW_AT_decl_line	(50)

0x0000056c:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x08d9 "subroutine *")
                  DW_AT_name	("AvahiTimeoutCallback")
                  DW_AT_decl_file	("//usr/include/avahi-common/watch.h")
                  DW_AT_decl_line	(53)

0x00000577:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0907 "AvahiClient")
                  DW_AT_name	("AvahiClient")
                  DW_AT_decl_file	("//usr/include/avahi-client/client.h")
                  DW_AT_decl_line	(37)

0x00000582:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x01f0 "enumeration ")
                  DW_AT_name	("AvahiClientState")
                  DW_AT_decl_file	("//usr/include/avahi-client/client.h")
                  DW_AT_decl_line	(46)

0x0000058d:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0215 "enumeration ")
                  DW_AT_name	("AvahiClientFlags")
                  DW_AT_decl_file	("//usr/include/avahi-client/client.h")
                  DW_AT_decl_line	(51)

0x00000598:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x090c "subroutine *")
                  DW_AT_name	("AvahiClientCallback")
                  DW_AT_decl_file	("//usr/include/avahi-client/client.h")
                  DW_AT_decl_line	(54)

0x000005a3:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0927 "AvahiDomainBrowser")
                  DW_AT_name	("AvahiDomainBrowser")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(44)

0x000005ae:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x092c "subroutine *")
                  DW_AT_name	("AvahiDomainBrowserCallback")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(47)

0x000005b9:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x096c "AvahiServiceBrowser")
                  DW_AT_name	("AvahiServiceBrowser")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(78)

0x000005c4:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0971 "subroutine *")
                  DW_AT_name	("AvahiServiceBrowserCallback")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(81)

0x000005cf:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x09aa "AvahiServiceTypeBrowser")
                  DW_AT_name	("AvahiServiceTypeBrowser")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(123)

0x000005da:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x09af "subroutine *")
                  DW_AT_name	("AvahiServiceTypeBrowserCallback")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(126)

0x000005e5:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x09e3 "AvahiServiceResolver")
                  DW_AT_name	("AvahiServiceResolver")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(157)

0x000005f0:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x09e8 "subroutine *")
                  DW_AT_name	("AvahiServiceResolverCallback")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(160)

0x000005fb:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0a4b "AvahiHostNameResolver")
                  DW_AT_name	("AvahiHostNameResolver")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(211)

0x00000606:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0a50 "subroutine *")
                  DW_AT_name	("AvahiHostNameResolverCallback")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(214)

0x00000611:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0a84 "AvahiAddressResolver")
                  DW_AT_name	("AvahiAddressResolver")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(242)

0x0000061c:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0a89 "subroutine *")
                  DW_AT_name	("AvahiAddressResolverCallback")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(245)

0x00000627:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0abd "AvahiRecordBrowser")
                  DW_AT_name	("AvahiRecordBrowser")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(276)

0x00000633:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0ac2 "subroutine *")
                  DW_AT_name	("AvahiRecordBrowserCallback")
                  DW_AT_decl_file	("//usr/include/avahi-client/lookup.h")
                  DW_AT_decl_line	(279)

0x0000063f:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0b0b "AvahiSimplePoll")
                  DW_AT_name	("AvahiSimplePoll")
                  DW_AT_decl_file	("//usr/include/avahi-common/simple-watch.h")
                  DW_AT_decl_line	(34)

0x0000064a:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0b10 "subroutine int*")
                  DW_AT_name	("AvahiPollFunc")
                  DW_AT_decl_file	("//usr/include/avahi-common/simple-watch.h")
                  DW_AT_decl_line	(63)

0x00000655:     DW_TAG_structure_type
                  DW_AT_name	("AvahiAllocator")
                  DW_AT_byte_size	(0x20)
                  DW_AT_decl_file	("//usr/include/avahi-common/malloc.h")
                  DW_AT_decl_line	(75)

0x0000065d:       DW_TAG_member
                    DW_AT_name	("malloc")
                    DW_AT_type	(cu + 0x0b34 "subroutine **")
                    DW_AT_decl_file	("//usr/include/avahi-common/malloc.h")
                    DW_AT_decl_line	(76)
                    DW_AT_data_member_location	(0x00)

0x00000669:       DW_TAG_member
                    DW_AT_name	("free")
                    DW_AT_type	(cu + 0x0b44 "subroutine *")
                    DW_AT_decl_file	("//usr/include/avahi-common/malloc.h")
                    DW_AT_decl_line	(77)
                    DW_AT_data_member_location	(0x08)

0x00000675:       DW_TAG_member
                    DW_AT_name	("realloc")
                    DW_AT_type	(cu + 0x0b50 "subroutine **")
                    DW_AT_decl_file	("//usr/include/avahi-common/malloc.h")
                    DW_AT_decl_line	(78)
                    DW_AT_data_member_location	(0x10)

0x00000681:       DW_TAG_member
                    DW_AT_name	("calloc")
                    DW_AT_type	(cu + 0x0b65 "subroutine **")
                    DW_AT_decl_file	("//usr/include/avahi-common/malloc.h")
                    DW_AT_decl_line	(79)
                    DW_AT_data_member_location	(0x18)

0x0000068d:       NULL

0x0000068e:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x0655 "AvahiAllocator")
                  DW_AT_name	("AvahiAllocator")
                  DW_AT_decl_file	("//usr/include/avahi-common/malloc.h")
                  DW_AT_decl_line	(80)

0x00000699:     NULL

0x0000069a:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x000006a1:   DW_TAG_module
                DW_AT_name	("SwiftGlibc")
                DW_AT_LLVM_config_macros	("\"-D__swift__=40150\"")
                DW_AT_LLVM_include_path	("/opt/swift-4.2.1-RELEASE-ubuntu18.04/usr/lib/swift/linux/x86_64")
                DW_AT_LLVM_isysroot	("/")

0x000006b2:     DW_TAG_module
                  DW_AT_name	("C")
                  DW_AT_LLVM_config_macros	("\"-D__swift__=40150\"")
                  DW_AT_LLVM_include_path	("/opt/swift-4.2.1-RELEASE-ubuntu18.04/usr/lib/swift/linux/x86_64")
                  DW_AT_LLVM_isysroot	("/")

0x000006c3:       DW_TAG_module
                    DW_AT_name	("inttypes")
                    DW_AT_LLVM_config_macros	("\"-D__swift__=40150\"")
                    DW_AT_LLVM_include_path	("/opt/swift-4.2.1-RELEASE-ubuntu18.04/usr/lib/swift/linux/x86_64")
                    DW_AT_LLVM_isysroot	("/")

0x000006d4:         DW_TAG_typedef
                      DW_AT_type	(cu + 0x0719 "__uint32_t")
                      DW_AT_name	("uint32_t")
                      DW_AT_decl_file	("//usr/include/x86_64-linux-gnu/bits/stdint-uintn.h")
                      DW_AT_decl_line	(26)

0x000006df:         DW_TAG_typedef
                      DW_AT_type	(cu + 0x0724 "__uint8_t")
                      DW_AT_name	("uint8_t")
                      DW_AT_decl_file	("//usr/include/x86_64-linux-gnu/bits/stdint-uintn.h")
                      DW_AT_decl_line	(24)

0x000006ea:         DW_TAG_typedef
                      DW_AT_type	(cu + 0x072f "__uint16_t")
                      DW_AT_name	("uint16_t")
                      DW_AT_decl_file	("//usr/include/x86_64-linux-gnu/bits/stdint-uintn.h")
                      DW_AT_decl_line	(25)

0x000006f5:         NULL

0x000006f6:       NULL

0x000006f7:     DW_TAG_module
                  DW_AT_name	("POSIX")
                  DW_AT_LLVM_config_macros	("\"-D__swift__=40150\"")
                  DW_AT_LLVM_include_path	("/opt/swift-4.2.1-RELEASE-ubuntu18.04/usr/lib/swift/linux/x86_64")
                  DW_AT_LLVM_isysroot	("/")

0x00000708:       DW_TAG_module
                    DW_AT_name	("termios")
                    DW_AT_LLVM_config_macros	("\"-D__swift__=40150\"")
                    DW_AT_LLVM_include_path	("/opt/swift-4.2.1-RELEASE-ubuntu18.04/usr/lib/swift/linux/x86_64")
                    DW_AT_LLVM_isysroot	("/")

0x00000719:         DW_TAG_typedef
                      DW_AT_type	(cu + 0x079a "unsigned int")
                      DW_AT_name	("__uint32_t")
                      DW_AT_decl_file	("//usr/include/x86_64-linux-gnu/bits/types.h")
                      DW_AT_decl_line	(41)

0x00000724:         DW_TAG_typedef
                      DW_AT_type	(cu + 0x07ad "unsigned char")
                      DW_AT_name	("__uint8_t")
                      DW_AT_decl_file	("//usr/include/x86_64-linux-gnu/bits/types.h")
                      DW_AT_decl_line	(37)

0x0000072f:         DW_TAG_typedef
                      DW_AT_type	(cu + 0x0a3f "unsigned short")
                      DW_AT_name	("__uint16_t")
                      DW_AT_decl_file	("//usr/include/x86_64-linux-gnu/bits/types.h")
                      DW_AT_decl_line	(39)

0x0000073a:         NULL

0x0000073b:       DW_TAG_module
                    DW_AT_name	("sys")
                    DW_AT_LLVM_config_macros	("\"-D__swift__=40150\"")
                    DW_AT_LLVM_include_path	("/opt/swift-4.2.1-RELEASE-ubuntu18.04/usr/lib/swift/linux/x86_64")
                    DW_AT_LLVM_isysroot	("/")

0x0000074c:         DW_TAG_module
                      DW_AT_name	("types")
                      DW_AT_LLVM_config_macros	("\"-D__swift__=40150\"")
                      DW_AT_LLVM_include_path	("/opt/swift-4.2.1-RELEASE-ubuntu18.04/usr/lib/swift/linux/x86_64")
                      DW_AT_LLVM_isysroot	("/")

0x0000075d:           DW_TAG_typedef
                        DW_AT_type	(cu + 0x081f "long unsigned int")
                        DW_AT_name	("size_t")
                        DW_AT_decl_file	("/opt/swift-4.2.1-RELEASE-ubuntu18.04/usr/lib/swift/clang/include/stddef.h")
                        DW_AT_decl_line	(62)

0x00000768:           NULL

0x00000769:         DW_TAG_module
                      DW_AT_name	("select")
                      DW_AT_LLVM_config_macros	("\"-D__swift__=40150\"")
                      DW_AT_LLVM_include_path	("/opt/swift-4.2.1-RELEASE-ubuntu18.04/usr/lib/swift/linux/x86_64")
                      DW_AT_LLVM_isysroot	("/")

0x0000077a:           DW_TAG_structure_type
                        DW_AT_name	("timeval")
                        DW_AT_declaration	(true)

0x0000077f:           NULL

0x00000780:         NULL

0x00000781:       DW_TAG_module
                    DW_AT_name	("poll")
                    DW_AT_LLVM_config_macros	("\"-D__swift__=40150\"")
                    DW_AT_LLVM_include_path	("/opt/swift-4.2.1-RELEASE-ubuntu18.04/usr/lib/swift/linux/x86_64")
                    DW_AT_LLVM_isysroot	("/")

0x00000792:         DW_TAG_structure_type
                      DW_AT_name	("pollfd")
                      DW_AT_declaration	(true)

0x00000797:         NULL

0x00000798:       NULL

0x00000799:     NULL

0x0000079a:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x000007a1:   DW_TAG_array_type
                DW_AT_type	(cu + 0x06df "uint8_t")

0x000007a6:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x07b4 "sizetype")
                  DW_AT_count	(0x10)

0x000007ac:     NULL

0x000007ad:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x000007b4:   DW_TAG_base_type
                DW_AT_name	("sizetype")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x000007bb:   DW_TAG_array_type
                DW_AT_type	(cu + 0x06df "uint8_t")

0x000007c0:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x07b4 "sizetype")
                  DW_AT_count	(0x01)

0x000007c6:     NULL

0x000007c7:   DW_TAG_module
                DW_AT_name	("module.modulemap")
                DW_AT_LLVM_config_macros	("\"-D__swift__=40150\"")
                DW_AT_LLVM_isysroot	("/")

0x000007d4:     DW_TAG_typedef
                  DW_AT_type	(cu + 0x080d "__va_list_tag[]")
                  DW_AT_name	("__builtin_va_list")

0x000007dd:     DW_TAG_structure_type
                  DW_AT_name	("__va_list_tag")
                  DW_AT_byte_size	(0x18)

0x000007e3:       DW_TAG_member
                    DW_AT_name	("gp_offset")
                    DW_AT_type	(cu + 0x079a "unsigned int")
                    DW_AT_data_member_location	(0x00)

0x000007ed:       DW_TAG_member
                    DW_AT_name	("fp_offset")
                    DW_AT_type	(cu + 0x079a "unsigned int")
                    DW_AT_data_member_location	(0x04)

0x000007f7:       DW_TAG_member
                    DW_AT_name	("overflow_arg_area")
                    DW_AT_type	(cu + 0x0819 "*")
                    DW_AT_data_member_location	(0x08)

0x00000801:       DW_TAG_member
                    DW_AT_name	("reg_save_area")
                    DW_AT_type	(cu + 0x0819 "*")
                    DW_AT_data_member_location	(0x10)

0x0000080b:       NULL

0x0000080c:     NULL

0x0000080d:   DW_TAG_array_type
                DW_AT_type	(cu + 0x07dd "__va_list_tag")

0x00000812:     DW_TAG_subrange_type
                  DW_AT_type	(cu + 0x07b4 "sizetype")
                  DW_AT_count	(0x01)

0x00000818:     NULL

0x00000819:   DW_TAG_pointer_type

0x0000081a:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0436 "AvahiStringList")

0x0000081f:   DW_TAG_base_type
                DW_AT_name	("long unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x08)

0x00000826:   DW_TAG_structure_type
                DW_AT_name	("AvahiWatch")
                DW_AT_declaration	(true)

0x0000082b:   DW_TAG_structure_type
                DW_AT_name	("AvahiTimeout")
                DW_AT_declaration	(true)

0x00000830:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0835 "subroutine AvahiWatch*")

0x00000835:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0854 "AvahiWatch*")
                DW_AT_prototyped	(true)

0x0000083a:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0859 "const AvahiPoll*")

0x0000083f:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x069a "int")

0x00000844:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0556 "AvahiWatchEvent")

0x00000849:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0561 "AvahiWatchCallback")

0x0000084e:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0819 "*")

0x00000853:     NULL

0x00000854:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x04cc "AvahiWatch")

0x00000859:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x085e "const AvahiPoll")

0x0000085e:   DW_TAG_const_type
                DW_AT_type	(cu + 0x04e2 "AvahiPoll")

0x00000863:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0868 "subroutine ")

0x00000868:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000869:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0854 "AvahiWatch*")

0x0000086e:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x069a "int")

0x00000873:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0556 "AvahiWatchEvent")

0x00000878:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0819 "*")

0x0000087d:     NULL

0x0000087e:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0883 "subroutine ")

0x00000883:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x00000884:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0854 "AvahiWatch*")

0x00000889:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0556 "AvahiWatchEvent")

0x0000088e:     NULL

0x0000088f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x0894 "subroutine AvahiWatchEvent")

0x00000894:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x0556 "AvahiWatchEvent")
                DW_AT_prototyped	(true)

0x00000899:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0854 "AvahiWatch*")

0x0000089e:     NULL

0x0000089f:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x08a4 "subroutine ")

0x000008a4:   DW_TAG_subroutine_type
                DW_AT_prototyped	(true)

0x000008a5:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0854 "AvahiWatch*")

0x000008aa:     NULL

0x000008ab:   DW_TAG_pointer_type
                DW_AT_type	(cu + 0x08b0 "subroutine AvahiTimeout*")

0x000008b0:   DW_TAG_subroutine_type
                DW_AT_type	(cu + 0x08ca "AvahiTimeout*")
                DW_AT_prototyped	(true)

0x000008b5:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x0859 "const AvahiPoll*")

0x000008ba:     DW_TAG_formal_parameter
                  DW_AT_type	(cu + 0x08cf "const timeval*")

0x000008bf:     DW_TAG_formal_parameter
